array = [25, 4, 2001, 'Nursultan', 4, 5, 6]

if __name__ == '__main__':
    # array.append('Hello')  # Добавляет элемент в конец списка
    # array.extend(['Hi', 1234, ['Bye']])  # Расширяет список, добавляя в конец
    # array.insert(3, 'Mirlanov')  # Добавляет по индексу, не удаляя исходный элемент
    # array.remove('Hi')  # Удаляет элемент
    # array.pop(3)  # Удаляет элемент по индексу (если индекс не указан, удаляет последний элемент)
    # array.sort(key=lambda val: val == 4)  # Сортирует элементы списка в конец
    # (key = функция, принимающая аргументом элемент, для сравнения его с другими)
    # array.reverse()  # Разворачивает элементы списка
    # array.copy()  # Копирует список
    # array.clear()  # Очищает список

    # print(array.index(2001))  # Показывает индекс элемента
    # print(array.count(4))  # Показывает сколько таких элементов в списке

    print(array)